; domain
(define (domain industrial_manufacturing)
    (:requirements :strips :typing)
    (:types
        location box content agent workstation content-type carrier place - object
    )

    (:predicates
        (connected ?loc1 ?loc2 - location)
        (box-at-loc ?box - box ?loc - location)
        (agent-at-loc ?agent - agent ?loc - location)
        (ws-at-loc ?ws - workstation ?loc - location)
        (content-at-loc ?content - content ?loc - location)
        (is-type ?content - content ?t - content-type)
        (empty-box ?box - box)
        (filled-box ?box - box ?content - content)
        (box-at-ws ?box - box ?ws - workstation)
        (box-at-place ?box - box ?place - place)
        (content-type-at-ws ?t - content-type ?ws - workstation)
        (empty-place ?place - place)
        (place-at-carrier ?place - place ?carrier - carrier)
        (carrier-at-agent ?carrier - carrier ?agent - agent)
    )

    (:action pick-up
        :parameters (?loc - location ?box - box ?agent - agent ?carrier - carrier ?place - place)
        :precondition (and
            (agent-at-loc ?agent ?loc)
            (box-at-loc ?box ?loc)
            (carrier-at-agent ?carrier ?agent)
            (place-at-carrier ?place ?carrier)
            (empty-place ?place)
        )
        :effect (and
            (box-at-place ?box ?place)
            (not (empty-place ?place))
            (not (box-at-loc ?box ?loc))
        )
    )

    (:action move
        :parameters (?from ?to - location ?agent - agent)
        :precondition (and
            (connected ?from ?to)
            (agent-at-loc ?agent ?from)
        )
        :effect (and
            (not (agent-at-loc ?agent ?from))
            (agent-at-loc ?agent ?to)
        )
    )

    (:action deliver
        :parameters (?box - box ?content - content ?t - content-type ?ws - workstation ?location - location ?agent - agent ?carrier - carrier ?place - place)
        :precondition (and
            (is-type ?content ?t)
            (ws-at-loc ?ws ?location)
            (agent-at-loc ?agent ?location)
            (carrier-at-agent ?carrier ?agent)
            (place-at-carrier ?place ?carrier)
            (box-at-place ?box ?place)
            (filled-box ?box ?content)
        )
        :effect (and
            (not (box-at-place ?box ?place))
            (empty-place ?place)
            (box-at-ws ?box ?ws)
        )
    )

    (:action fill
        :parameters (?box - box ?content - content ?t - content-type ?loc - location ?agent - agent ?carrier - carrier ?place - place)
        :precondition (and
            (is-type ?content ?t)
            (content-at-loc ?content ?loc)
            (agent-at-loc ?agent ?loc)
            (carrier-at-agent ?carrier ?agent)
            (place-at-carrier ?place ?carrier)
            (box-at-place ?box ?place)
            (empty-box ?box)
        )
        :effect (and
            (not (empty-box ?box))
            (filled-box ?box ?content)
            (not (content-at-loc ?content ?loc))
        )
    )

    (:action empty
        :parameters (?box - box ?content - content ?t - content-type ?ws - workstation ?agent - agent ?loc - location)
        :precondition (and
            (is-type ?content ?t)
            (box-at-ws ?box ?ws)
            (ws-at-loc ?ws ?loc)
            (filled-box ?box ?content)
            (agent-at-loc ?agent ?loc)
        )
        :effect (and
            (not (filled-box ?box ?content))
            (empty-box ?box)
            (box-at-loc ?box ?loc)
            (not (box-at-ws ?box ?ws))
            (content-type-at-ws ?t ?ws)
        )
    )
)

; problem
(define
    (problem p04)
    (:domain industrial_manufacturing)

    (:objects
        central_warehouse loc1 loc2 loc3 - location
        ws1 ws2 ws3 ws4 ws5 - workstation
        b1 b2 b3 b4 b5 b6 b7 - box
        a1 a2 - agent
        c1 c2 - carrier
        p11 p12 p21 p22 - place
        valve1 valve2
        bolt1 bolt2 bolt3
        hammer1 hammer2 hammer3
        screwdriver1 screwdriver2 screwdriver3 - content
        valve bolt hammer screwdriver - content-type
    )

    (:init
        (is-type valve1 valve)
        (is-type valve2 valve)
        (is-type bolt1 bolt)
        (is-type bolt2 bolt)
        (is-type bolt3 bolt)
        (is-type hammer1 hammer)
        (is-type hammer2 hammer)
        (is-type hammer3 hammer)
        (is-type screwdriver1 screwdriver)
        (is-type screwdriver2 screwdriver)
        (is-type screwdriver3 screwdriver)

        (content-at-loc valve1 central_warehouse)
        (content-at-loc valve2 central_warehouse)
        (content-at-loc bolt1 central_warehouse)
        (content-at-loc bolt2 central_warehouse)
        (content-at-loc bolt3 central_warehouse)
        (content-at-loc hammer1 central_warehouse)
        (content-at-loc hammer2 central_warehouse)
        (content-at-loc hammer3 central_warehouse)
        (content-at-loc screwdriver1 central_warehouse)
        (content-at-loc screwdriver2 central_warehouse)
        (content-at-loc screwdriver3 central_warehouse)

        (box-at-loc b1 central_warehouse)
        (box-at-loc b2 central_warehouse)
        (box-at-loc b3 central_warehouse)
        (box-at-loc b4 central_warehouse)
        (box-at-loc b5 central_warehouse)
        (box-at-loc b6 central_warehouse)
        (box-at-loc b7 central_warehouse)
        (empty-box b1)
        (empty-box b2)
        (empty-box b3)
        (empty-box b4)
        (empty-box b5)
        (empty-box b6)
        (empty-box b7)

        (ws-at-loc ws1 loc1)
        (ws-at-loc ws2 loc1)
        (ws-at-loc ws3 loc2)
        (ws-at-loc ws4 loc3)
        (ws-at-loc ws5 loc3)

        (connected central_warehouse loc1)
        (connected central_warehouse loc2)
        (connected central_warehouse loc3)
        (connected loc1 central_warehouse)
        (connected loc2 central_warehouse)
        (connected loc3 central_warehouse)

        (agent-at-loc a1 central_warehouse)
        (carrier-at-agent c1 a1)
        (place-at-carrier p11 c1)
        (place-at-carrier p12 c1)
        (empty-place p11)
        (empty-place p12)
        (agent-at-loc a2 central_warehouse)
        (carrier-at-agent c2 a2)
        (place-at-carrier p21 c2)
        (place-at-carrier p22 c2)
        (empty-place p21)
        (empty-place p22)
    )

    (:goal
        (and
            (content-type-at-ws hammer ws1)
            (content-type-at-ws screwdriver ws1)
            (content-type-at-ws valve ws1)
            (content-type-at-ws bolt ws1)
            (content-type-at-ws hammer ws2)
            (content-type-at-ws bolt ws2)
            (content-type-at-ws screwdriver ws2)
            (content-type-at-ws hammer ws3)
            (content-type-at-ws screwdriver ws3)
            (content-type-at-ws valve ws3)
            (content-type-at-ws bolt ws3)
        )
    )
)

; plan
1. (move central_warehouse loc1 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc1)
   goals met: 0 of 11
2. (pick-up central_warehouse b7 a2 c2 p21)
   deleted: (empty-place p21) (box-at-loc b7 central_warehouse)
   added: (box-at-place b7 p21)
   goals met: 0 of 11
3. (fill b7 hammer1 hammer central_warehouse a2 c2 p21)
   deleted: (empty-box b7) (content-at-loc hammer1 central_warehouse)
   added: (filled-box b7 hammer1)
   goals met: 0 of 11
4. (move central_warehouse loc1 a2)
   deleted: (agent-at-loc a2 central_warehouse)
   added: (agent-at-loc a2 loc1)
   goals met: 0 of 11
5. (deliver b7 hammer1 hammer ws1 loc1 a2 c2 p21)
   deleted: (box-at-place b7 p21)
   added: (empty-place p21) (box-at-ws b7 ws1)
   goals met: 0 of 11
6. (empty b7 hammer1 hammer ws1 a1 loc1)
   deleted: (filled-box b7 hammer1) (box-at-ws b7 ws1)
   added: (empty-box b7) (box-at-loc b7 loc1) (content-type-at-ws hammer ws1)
   goals met: 1 of 11
7. (pick-up loc1 b7 a1 c1 p11)
   deleted: (empty-place p11) (box-at-loc b7 loc1)
   added: (box-at-place b7 p11)
   goals met: 1 of 11
8. (move loc1 central_warehouse a1)
   deleted: (agent-at-loc a1 loc1)
   added: (agent-at-loc a1 central_warehouse)
   goals met: 1 of 11
9. (fill b7 hammer2 hammer central_warehouse a1 c1 p11)
   deleted: (empty-box b7) (content-at-loc hammer2 central_warehouse)
   added: (filled-box b7 hammer2)
   goals met: 1 of 11
10. (move central_warehouse loc2 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc2)
   goals met: 1 of 11
11. (deliver b7 hammer2 hammer ws3 loc2 a1 c1 p11)
   deleted: (box-at-place b7 p11)
   added: (empty-place p11) (box-at-ws b7 ws3)
   goals met: 1 of 11
12. (empty b7 hammer2 hammer ws3 a1 loc2)
   deleted: (filled-box b7 hammer2) (box-at-ws b7 ws3)
   added: (empty-box b7) (box-at-loc b7 loc2) (content-type-at-ws hammer ws3)
   goals met: 2 of 11
13. (pick-up loc2 b7 a1 c1 p11)
   deleted: (empty-place p11) (box-at-loc b7 loc2)
   added: (box-at-place b7 p11)
   goals met: 2 of 11
14. (move loc2 central_warehouse a1)
   deleted: (agent-at-loc a1 loc2)
   added: (agent-at-loc a1 central_warehouse)
   goals met: 2 of 11
15. (fill b7 screwdriver1 screwdriver central_warehouse a1 c1 p11)
   deleted: (empty-box b7) (content-at-loc screwdriver1 central_warehouse)
   added: (filled-box b7 screwdriver1)
   goals met: 2 of 11
16. (move central_warehouse loc2 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc2)
   goals met: 2 of 11
17. (deliver b7 screwdriver1 screwdriver ws3 loc2 a1 c1 p11)
   deleted: (box-at-place b7 p11)
   added: (empty-place p11) (box-at-ws b7 ws3)
   goals met: 2 of 11
18. (empty b7 screwdriver1 screwdriver ws3 a1 loc2)
   deleted: (filled-box b7 screwdriver1) (box-at-ws b7 ws3)
   added: (empty-box b7) (box-at-loc b7 loc2) (content-type-at-ws screwdriver ws3)
   goals met: 3 of 11
19. (pick-up loc2 b7 a1 c1 p11)
   deleted: (empty-place p11) (box-at-loc b7 loc2)
   added: (box-at-place b7 p11)
   goals met: 3 of 11
20. (move loc2 central_warehouse a1)
   deleted: (agent-at-loc a1 loc2)
   added: (agent-at-loc a1 central_warehouse)
   goals met: 3 of 11
21. (fill b7 valve1 valve central_warehouse a1 c1 p11)
   deleted: (empty-box b7) (content-at-loc valve1 central_warehouse)
   added: (filled-box b7 valve1)
   goals met: 3 of 11
22. (move central_warehouse loc2 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc2)
   goals met: 3 of 11
23. (deliver b7 valve1 valve ws3 loc2 a1 c1 p11)
   deleted: (box-at-place b7 p11)
   added: (empty-place p11) (box-at-ws b7 ws3)
   goals met: 3 of 11
24. (empty b7 valve1 valve ws3 a1 loc2)
   deleted: (filled-box b7 valve1) (box-at-ws b7 ws3)
   added: (empty-box b7) (box-at-loc b7 loc2) (content-type-at-ws valve ws3)
   goals met: 4 of 11
25. (pick-up loc2 b7 a1 c1 p11)
   deleted: (empty-place p11) (box-at-loc b7 loc2)
   added: (box-at-place b7 p11)
   goals met: 4 of 11
26. (move loc2 central_warehouse a1)
   deleted: (agent-at-loc a1 loc2)
   added: (agent-at-loc a1 central_warehouse)
   goals met: 4 of 11
27. (fill b7 bolt1 bolt central_warehouse a1 c1 p11)
   deleted: (empty-box b7) (content-at-loc bolt1 central_warehouse)
   added: (filled-box b7 bolt1)
   goals met: 4 of 11
28. (move central_warehouse loc2 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc2)
   goals met: 4 of 11
29. (deliver b7 bolt1 bolt ws3 loc2 a1 c1 p11)
   deleted: (box-at-place b7 p11)
   added: (empty-place p11) (box-at-ws b7 ws3)
   goals met: 4 of 11
30. (empty b7 bolt1 bolt ws3 a1 loc2)
   deleted: (filled-box b7 bolt1) (box-at-ws b7 ws3)
   added: (empty-box b7) (box-at-loc b7 loc2) (content-type-at-ws bolt ws3)
   goals met: 5 of 11
31. (move loc2 central_warehouse a1)
   deleted: (agent-at-loc a1 loc2)
   added: (agent-at-loc a1 central_warehouse)
   goals met: 5 of 11
32. (pick-up central_warehouse b6 a1 c1 p11)
   deleted: (empty-place p11) (box-at-loc b6 central_warehouse)
   added: (box-at-place b6 p11)
   goals met: 5 of 11
33. (fill b6 valve2 valve central_warehouse a1 c1 p11)
   deleted: (empty-box b6) (content-at-loc valve2 central_warehouse)
   added: (filled-box b6 valve2)
   goals met: 5 of 11
34. (move central_warehouse loc1 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc1)
   goals met: 5 of 11
35. (deliver b6 valve2 valve ws1 loc1 a1 c1 p11)
   deleted: (box-at-place b6 p11)
   added: (empty-place p11) (box-at-ws b6 ws1)
   goals met: 5 of 11
36. (empty b6 valve2 valve ws1 a1 loc1)
   deleted: (filled-box b6 valve2) (box-at-ws b6 ws1)
   added: (empty-box b6) (box-at-loc b6 loc1) (content-type-at-ws valve ws1)
   goals met: 6 of 11
37. (pick-up loc1 b6 a1 c1 p11)
   deleted: (empty-place p11) (box-at-loc b6 loc1)
   added: (box-at-place b6 p11)
   goals met: 6 of 11
38. (move loc1 central_warehouse a1)
   deleted: (agent-at-loc a1 loc1)
   added: (agent-at-loc a1 central_warehouse)
   goals met: 6 of 11
39. (fill b6 hammer3 hammer central_warehouse a1 c1 p11)
   deleted: (empty-box b6) (content-at-loc hammer3 central_warehouse)
   added: (filled-box b6 hammer3)
   goals met: 6 of 11
40. (move central_warehouse loc1 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc1)
   goals met: 6 of 11
41. (deliver b6 hammer3 hammer ws2 loc1 a1 c1 p11)
   deleted: (box-at-place b6 p11)
   added: (empty-place p11) (box-at-ws b6 ws2)
   goals met: 6 of 11
42. (empty b6 hammer3 hammer ws2 a1 loc1)
   deleted: (filled-box b6 hammer3) (box-at-ws b6 ws2)
   added: (empty-box b6) (box-at-loc b6 loc1) (content-type-at-ws hammer ws2)
   goals met: 7 of 11
43. (pick-up loc1 b6 a1 c1 p11)
   deleted: (empty-place p11) (box-at-loc b6 loc1)
   added: (box-at-place b6 p11)
   goals met: 7 of 11
44. (move loc1 central_warehouse a1)
   deleted: (agent-at-loc a1 loc1)
   added: (agent-at-loc a1 central_warehouse)
   goals met: 7 of 11
45. (fill b6 bolt2 bolt central_warehouse a1 c1 p11)
   deleted: (empty-box b6) (content-at-loc bolt2 central_warehouse)
   added: (filled-box b6 bolt2)
   goals met: 7 of 11
46. (pick-up central_warehouse b5 a1 c1 p12)
   deleted: (empty-place p12) (box-at-loc b5 central_warehouse)
   added: (box-at-place b5 p12)
   goals met: 7 of 11
47. (fill b5 bolt3 bolt central_warehouse a1 c1 p12)
   deleted: (empty-box b5) (content-at-loc bolt3 central_warehouse)
   added: (filled-box b5 bolt3)
   goals met: 7 of 11
48. (move central_warehouse loc1 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc1)
   goals met: 7 of 11
49. (deliver b6 bolt2 bolt ws1 loc1 a1 c1 p11)
   deleted: (box-at-place b6 p11)
   added: (empty-place p11) (box-at-ws b6 ws1)
   goals met: 7 of 11
50. (empty b6 bolt2 bolt ws1 a1 loc1)
   deleted: (filled-box b6 bolt2) (box-at-ws b6 ws1)
   added: (empty-box b6) (box-at-loc b6 loc1) (content-type-at-ws bolt ws1)
   goals met: 8 of 11
51. (deliver b5 bolt3 bolt ws2 loc1 a1 c1 p12)
   deleted: (box-at-place b5 p12)
   added: (empty-place p12) (box-at-ws b5 ws2)
   goals met: 8 of 11
52. (pick-up loc1 b6 a1 c1 p11)
   deleted: (empty-place p11) (box-at-loc b6 loc1)
   added: (box-at-place b6 p11)
   goals met: 8 of 11
53. (empty b5 bolt3 bolt ws2 a1 loc1)
   deleted: (filled-box b5 bolt3) (box-at-ws b5 ws2)
   added: (empty-box b5) (box-at-loc b5 loc1) (content-type-at-ws bolt ws2)
   goals met: 9 of 11
54. (move loc1 central_warehouse a1)
   deleted: (agent-at-loc a1 loc1)
   added: (agent-at-loc a1 central_warehouse)
   goals met: 9 of 11
55. (fill b6 screwdriver2 screwdriver central_warehouse a1 c1 p11)
   deleted: (empty-box b6) (content-at-loc screwdriver2 central_warehouse)
   added: (filled-box b6 screwdriver2)
   goals met: 9 of 11
56. (move central_warehouse loc1 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc1)
   goals met: 9 of 11
57. (deliver b6 screwdriver2 screwdriver ws1 loc1 a1 c1 p11)
   deleted: (box-at-place b6 p11)
   added: (empty-place p11) (box-at-ws b6 ws1)
   goals met: 9 of 11
58. (empty b6 screwdriver2 screwdriver ws1 a1 loc1)
   deleted: (filled-box b6 screwdriver2) (box-at-ws b6 ws1)
   added: (empty-box b6) (box-at-loc b6 loc1) (content-type-at-ws screwdriver ws1)
   goals met: 10 of 11
59. (pick-up loc1 b6 a1 c1 p11)
   deleted: (empty-place p11) (box-at-loc b6 loc1)
   added: (box-at-place b6 p11)
   goals met: 10 of 11
60. (move loc1 central_warehouse a1)
   deleted: (agent-at-loc a1 loc1)
   added: (agent-at-loc a1 central_warehouse)
   goals met: 10 of 11
61. (fill b6 screwdriver3 screwdriver central_warehouse a1 c1 p11)
   deleted: (empty-box b6) (content-at-loc screwdriver3 central_warehouse)
   added: (filled-box b6 screwdriver3)
   goals met: 10 of 11
62. (move central_warehouse loc1 a1)
   deleted: (agent-at-loc a1 central_warehouse)
   added: (agent-at-loc a1 loc1)
   goals met: 10 of 11
63. (deliver b6 screwdriver3 screwdriver ws2 loc1 a1 c1 p11)
   deleted: (box-at-place b6 p11)
   added: (empty-place p11) (box-at-ws b6 ws2)
   goals met: 10 of 11
64. (empty b6 screwdriver3 screwdriver ws2 a1 loc1)
   deleted: (filled-box b6 screwdriver3) (box-at-ws b6 ws2)
   added: (empty-box b6) (box-at-loc b6 loc1) (content-type-at-ws screwdriver ws2)
   goals met: 11 of 11
